Revit 2024 API
BuiltInFailures.AssemblyFailures.NoEligibleElementsInAssembly Property
 No eligible elements in assembly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoEligibleElementsInAssembly { get; }
Visual Basic
Public Shared ReadOnly Property NoEligibleElementsInAssembly As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoEligibleElementsInAssembly {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace